FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/uEZProcessor_LPC43xx.h
/*-------------------------------------------------------------------------*
 * File:  uEZProcessor_LPC43xx.h
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
* uEZ(r) - Copyright (C) 2007-2015 Future Designs, Inc.
*--------------------------------------------------------------------------
* This file is part of the uEZ(r) distribution.
*
* uEZ(r) is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License as published by
* the Free Software Foundation; either version 2 of the License, or
* (at your option) any later version.
*
* uEZ(r) is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License
* along with uEZ(r); if not, write to the Free Software
* Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
*
* A special exception to the GPL can be applied should you wish to
* distribute a combined work that includes uEZ(r), without being obliged
* to provide the source code for any proprietary components.  See the
* licensing section of http://goo.gl/UDtTCR for full details of how
* and when the exception can be applied.
*
*    *===============================================================*
*    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
*    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
*    *===============================================================*
*
*-------------------------------------------------------------------------*/
#ifndef _UEZPROCESSOR_LPC43xx_H_
#define _UEZPROCESSOR_LPC43xx_H_

#include <Config.h>
#include <CMSIS/LPC43xx.h> // It isn't possible to include this in IAR ASM
#include <Types/GPIO.h>
//#include "LPC43xx_UtilityFuncs.h" // Don't include this as it will interfere with RTOS malloc
#include "LPC43xx_EMAC.h"

// Information about the processor

// Currently UEZ_PROCESSOR_CORE_TYPE isn't used anywhere and would be non-portable.
// We use CORE_M4/CORE_M3/CORE_M0 everywhere and that is "standard" and comes from CMSIS.
// If we used sub core type, it would only ever be 1 type on 43XX parts, even on triple core parts.

#ifdef CORE_M4
#define UEZ_PROCESSOR_CORE_TYPE             CORE_TYPE_CORTEX_M4

#define UEZ_PROCESSOR_CORE_MODE             CORE_MODE_THUMB
//#define UEZ_PROCESSOR_CORE_SUBTYPE          CORE_SUBTYPE_NONE // Not used today
#else
#define UEZ_PROCESSOR_CORE_TYPE             CORE_TYPE_CORTEX_M0

#define UEZ_PROCESSOR_CORE_MODE             CORE_MODE_THUMB
//#define UEZ_PROCESSOR_CORE_SUBTYPE          CORE_SUBTYPE_NONE // Not used today
#endif

// AHB bases for Ethernet/USB memory. Generally USB will go first as it requires more alignment
#define AHBSRAM0_BASE       0x20000000  // 32K: usbhostsmem, then start of emacmem
#define AHBSRAM1_BASE       0x20008000  // 16K: emacmem continues
#define AHBSRAM2_BASE       0x2000C000  // 16K: emacmem continues or traceETB goes here

// External processor speed
#ifndef OSCILLATOR_CLOCK_FREQUENCY
#define OSCILLATOR_CLOCK_FREQUENCY          12000000    // Hz
#endif

#ifndef PROCESSOR_OSCILLATOR_FREQUENCY
#define PROCESSOR_OSCILLATOR_FREQUENCY      204000000    // Hz
#endif

// Option to put the name of the interrupts in the interrupt
// table for internal debugging
#ifndef LPC43XX_INTERRUPT_TRACK_NAMES
#define LPC43XX_INTERRUPT_TRACK_NAMES       0
#endif

// See IRQn_Type in LPC43XX.h
#ifdef CORE_M4
#define UEZ_MAX_IRQ_CHANNELS      53    // 0 - 52
#else // Same number for both M0 and M0SUB
#define UEZ_MAX_IRQ_CHANNELS      32    // 0 - 31
#endif


//#ifndef PCLK_DIVIDER
//#define PCLK_DIVIDER
//#endif

#define PCLK_FREQUENCY  UEZPlatform_GetPCLKFrequency()
#define Fpclk           PCLK_FREQUENCY

#define INTERRUPT_CHANNEL_ETHERNET  ENET_IRQn

// Macros for defining an interrupt context switch
#if (COMPILER_TYPE==GCC_ARM)
#define     IRQ_ROUTINE(name)  void name(void) ;\
                                void name(void)
#define     IRQ_START()
#define     IRQ_END()
#define     IRQ_HANDLER(funcname, param) \
                    IRQ_ROUTINE(funcname##_irq) \
                    IRQ_START() \
                    funcname(param);\
                    IRQ_END()
#ifndef   __packed
#define     __packed        __attribute__((packed))
#endif
#define INLINE inline __attribute__((always_inline))
#define     IN_INTERNAL_RAM  __attribute__((section(".IRAM")))
#endif // (COMPILER_TYPE==GCC_ARM)

#if (COMPILER_TYPE==IAR)
#define     IRQ_ROUTINE(name)  void name(void)
#define     IRQ_START() // context is saved by lower assembly routine
#define     IRQ_END()

#define     IRQ_HANDLER(funcname, param) \
                    IRQ_ROUTINE(funcname##_irq) \
                    IRQ_START() \
                    funcname(param);\
                    IRQ_END()
#define     INLINE          inline
#define     IN_INTERNAL_RAM  // tbd
#endif // (COMPILER_TYPE==IAR)

#if (COMPILER_TYPE==KEIL_UV)
#define     IRQ_ROUTINE(name)  void name(void) ;\
                                void name(void)
#define     IRQ_START()
#define     IRQ_END()
#define     IRQ_HANDLER(funcname, param) \
                    IRQ_ROUTINE(funcname##_irq) \
                    IRQ_START() \
                    funcname(param);\
                    IRQ_END()
#define     __packed        __attribute__((packed))
#define     INLINE          __inline
#define     IN_INTERNAL_RAM  // tbd
#endif // (COMPILER_TYPE==KEIL_UV)

#if(COMPILER_TYPE == GCC_ARM)
	#define NOP() __NOP()
#endif
#if (COMPILER_TYPE==IAR)
    #define NOP() __no_operation()
#endif
#if(COMPILER_TYPE == KEIL_UV)
	#define __NOP                             __nop
	#define NOP()	__NOP
#endif

// Enumerate all available GPIO pins on the processor and convert to shorthand, based on LBGA256
// Port 0:
#define GPIO_P0_0       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 0 ) //P0_0  func 0
#define GPIO_P0_1       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 1 ) //P0_1  func 0
#define GPIO_P0_2       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 2 ) //P1_15 func 0
#define GPIO_P0_3       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 3 ) //P1_16 func 0
#define GPIO_P0_4       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 4 ) //P1_0  func 0
#define GPIO_P0_5       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 5 ) //P6_6  func 0
#define GPIO_P0_6       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 6 ) //P3_6  func 0
#define GPIO_P0_7       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 7 ) //P2_7  func 0
#define GPIO_P0_8       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 8 ) //P1_1  func 0
#define GPIO_P0_9       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 9 ) //P1_2  func 0
#define GPIO_P0_10      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 10) //P1_3  func 0
#define GPIO_P0_11      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 11) //P1_4  func 0
#define GPIO_P0_12      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 12) //P1_17 func 0
#define GPIO_P0_13      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 13) //P1_18 func 0
#define GPIO_P0_14      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 14) //P2_10 func 0
#define GPIO_P0_15      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_0, 15) //P1_20 func 0

// Port 1:
#define GPIO_P1_0       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 0 ) //P1_7  func 0
#define GPIO_P1_1       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 1 ) //P1_8  func 0
#define GPIO_P1_2       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 2 ) //P1_9  func 0
#define GPIO_P1_3       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 3 ) //P1_10 func 0
#define GPIO_P1_4       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 4 ) //P1_11 func 0
#define GPIO_P1_5       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 5 ) //P1_12 func 0
#define GPIO_P1_6       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 6 ) //P1_13 func 0
#define GPIO_P1_7       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 7 ) //P1_7  func 0
#define GPIO_P1_8       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 8 ) //P1_5  func 0
#define GPIO_P1_9       UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 9 ) //P1_6  func 0
#define GPIO_P1_10      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 10) //P2_9  func 0
#define GPIO_P1_11      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 11) //P2_10 func 0
#define GPIO_P1_12      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 12) //P2_12 fucn 0
#define GPIO_P1_13      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 13) //P2_13 func 0
#define GPIO_P1_14      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 14) //P3_4  func 0
#define GPIO_P1_15      UEZ_GPIO_PORT_PIN(UEZ_GPIO_PORT_1, 15) //P3_5  func 0

