FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/uEZProcessor_LPC43xx.h
//Normal drive pins, most pins (others will be listed below)
#define SCU_NORMAL_DRIVE(mode, epd, epun, ehs, ezi, zif) \
        (mode | epd | epun | ehs | ezi | zif)

//High Drive pins, P1_17, P2_3 to P2_5, P8_0 to P8_2, PA_1 to PA_3
#define SCU_HIGH_DRIVE(mode, epd, epun, ezi, zif, ehd) \
        (mode | epd | epun | ezi | zif | ehd)

//High speed pins, P3_3 and CLK0 to CLK3
#define SCU_HIGH_SPEED(mode, epd, epun, ehs, ezi, zif) \
        (mode | epd | epun | ehs | ezi | zif)

//USB1 Pins
#define SCU_USB1_DP_DM(aim, esea, epd, epwr, vbus) \
        (aim | esea | epd | epwr | vbus)

//I2C Pins
#define SCU_I2C_SDA_SCL(scl_efp , scl_ehd , scl_ezi , scl_zif , sda_efp , sda_ehd , sda_ezi , sda_zif) \
                       (scl_efp | scl_ehd | scl_ezi | scl_zif | sda_efp | sda_ehd | sda_ezi | sda_zif)

// Normal pins using normal registers
#define SCU_NORMAL_DRIVE_DEFAULT(mode) \
        SCU_NORMAL_DRIVE(mode, \
                SCU_EPD_DISABLE, \
                SCU_EPUN_DISABLE, \
                SCU_EHS_FAST, \
                SCU_EZI_ENABLE, \
                SCU_ZIF_ENABLE)
// Normal pins using normal registers in high freq mode
#define SCU_NORMAL_DRIVE_HIGH_FREQ(mode) \
        SCU_NORMAL_DRIVE(mode, \
                SCU_EPD_DISABLE, \
                SCU_EPUN_DISABLE, \
                SCU_EHS_FAST, \
                SCU_EZI_ENABLE, \
                SCU_ZIF_DISABLE)  // Disable filter for 30+MHZ signals

// Normal pins using normal registers in high freq mode output only // Use for LCD, etc.
#define SCU_NORMAL_DRIVE_HIGH_FREQ_OUTPUT_ONLY(mode) \
        SCU_NORMAL_DRIVE(mode, \
                SCU_EPD_DISABLE, \
                SCU_EPUN_DISABLE, \
                SCU_EHS_FAST, \
                SCU_EZI_DISABLE, \
                SCU_ZIF_DISABLE)  // Disable filter for 30+MHZ signals

// High drive pins only: P1_17, P2_3 to P2_5, P8_0 to P8_2, PA_1 to PA_3
#define SCU_HIGH_DRIVE_DEFAULT(mode) \
        SCU_HIGH_DRIVE(mode, \
                SCU_EPD_DISABLE, \
                SCU_EPUN_DISABLE, \
                SCU_EZI_ENABLE, \
                SCU_ZIF_ENABLE, \
                SCU_EHD_NORMAL)
                
// High drive pins only in high freq mode // Use for LCD, etc.
#define SCU_HIGH_DRIVE_HIGH_FREQ_OUTPUT_ONLY(mode) \
        SCU_HIGH_DRIVE(mode, \
                SCU_EPD_DISABLE, \
                SCU_EPUN_DISABLE, \
                SCU_EZI_DISABLE, \
                SCU_ZIF_DISABLE, \
                SCU_EHD_NORMAL)

// P3_3 and pins CLK0 to CLK3 only
#define SCU_HIGH_SPEED_DEFAULT(mode) \
        SCU_HIGH_SPEED(mode, \
                SCU_EPD_DISABLE, \
                SCU_EPUN_DISABLE, \
                SCU_EHS_FAST, \
                SCU_EZI_ENABLE, \
                SCU_ZIF_ENABLE)

#define SCU_USB1_DP_DM_DEFAULT \
        SCU_USB1_DP_DM()

#define SCU_I2C_SDA_SCL_DEFAULT \
        SCU_I2C_SDA_SCL(SCU_I2C_SCL_EFP_50, SCU_I2C_SCL_EHD_STD_FAST, SCU_I2C_SCL_EZI_ENABLE, SCU_I2C_SCL_ZIF_DISABLE, \
                        SCU_I2C_SDA_EFP_50, SCU_I2C_SDA_EHD_STD_FAST, SCU_I2C_SDA_EZI_ENABLE, SCU_I2C_SDA_ZIF_DISABLE)


#endif // _UEZPROCESSOR_LPCLPC43xx_H_
/*-------------------------------------------------------------------------*
 * End of File:  uEZProcessor_LPCLPC43xx.h
 *-------------------------------------------------------------------------*/
